{
  "topics": [
    {
      "topic": "Introduction to Stochastic Programming",
      "sub_topics": [
        "Stochastic programming addresses optimization problems where the objective function involves random variables. It aims to optimize the expected value of a random outcome, modeled by a function F(x, w), where x is the decision variable and w is the random event. The stochastic optimization model minimizes the expected value function f(x) := E[F(x, w)] over a feasible set X, effectively optimizing the random outcome F(x, w) on average. This approach is justified when the Law of Large Numbers applies and the focus is on long-term performance, disregarding short-term fluctuations.",
        "Deterministic optimization assumes known parameters, whereas stochastic programming explicitly models uncertainty. This provides solutions robust against variability and applicable when decisions must account for a range of possible scenarios. A deterministic approach to optimization may lead to unreasonable solutions when applied to stochastic problems, as it ignores the risk associated with the variability of outcomes, potentially leading to significant losses in specific realizations.",
        "Stochastic programming is particularly useful in real-world scenarios such as portfolio selection, where decisions must balance expected return with risk, and in supply chain management, where demand and supply uncertainties need to be considered.",
        "Risk-averse stochastic optimization considers the expected values of scalar transformations u of the outcomes, where the choice of u reflects preferences. In a minimization context, a random outcome Z₁ is preferred over Z₂ if E[u(Z₁)] < E[u(Z₂)]."
      ]
    },
    {
      "topic": "Mean-Risk Models",
      "sub_topics": [
        "Mean-risk models characterize uncertain outcomes Zx(w) = F(x, w) using two scalar characteristics: the mean E[Zx], which describes the expected outcome, and the risk (dispersion measure) D[Zx], which measures the uncertainty of the outcome. The mean-risk approach seeks efficient solutions by minimizing risk for a given mean or maximizing the mean for a given risk, formulating the problem as a parametric optimization to facilitate trade-off analysis between mean and risk. Scalarization is a technique used in the mean-risk approach to form a composite objective functional ρ[Z] := E[Z] + cD[Z], where c > 0 represents the price of risk, allowing for the generation of a range of efficient solutions by varying c.",
        "Variance, defined as D[Z] := Var[Z], serves as a risk functional, quantifying the spread of possible outcomes around the expected value. However, it treats excesses and shortfalls equally, which may not be suitable for all risk preferences.",
        "Semideviations, including upper and lower semideviations of order p, are risk functionals that penalize excesses over the mean (for minimization problems) or shortfalls below the mean (for maximization problems), providing a more nuanced approach to risk management. The upper semideviation of order p is defined as σ+p[Z] := (E[(Z - E[Z])p]+)1/p, penalizing excesses over the mean in minimization problems, and the lower semideviation is defined analogously for maximization problems.",
        "Weighted mean deviations from quantiles, defined as qα[Z] := E[max{(1 − α)(H⁻¹(α) − Z), α(Z − H⁻¹(α))}], quantify risk by considering deviations from a quantile, where H⁻¹(α) is the left-side α-quantile of the random variable Z, and α is a parameter in (0, 1).",
        "Average Value-at-Risk (AV@R), also called Conditional Value-at-Risk, is defined as AV@Rα(Z) := inf{t + α⁻¹E[Z − t]+}, where Z represents losses, and it is closely related to the mean-deviation from quantile model. It is well defined and finite valued for every Z ∈ L₁(Ω, F, P).",
        "Coherent risk measures, satisfying convexity, monotonicity, translation equivariance, and positive homogeneity, provide a consistent framework for quantifying and managing risk, with Average Value-at-Risk being an example of such a measure."
      ]
    },
    {
      "topic": "Quantiles and Value-at-Risk",
      "sub_topics": [
        "The left-side α-quantile of a random variable Z is defined as H⁻¹(α) := inf{t : Hz(t) ≥ α}, where Hz(z) = Pr(Z ≤ z) is the cumulative distribution function, and the right-side α-quantile is defined as sup{t : Hz(t) ≤ α}.",
        "Value-at-Risk (V@R) is defined as the left-side quantile H⁻¹(1 − α), representing losses larger than V@R occurring with probability not exceeding α, and satisfies the property V@R(Z + τ) = V@R(Z) + τ for any constant τ."
      ]
    },
    {
      "topic": "Weighted Mean Deviations from Quantiles and Average Value-at-Risk",
      "sub_topics": [
        "Weighted mean deviation from a quantile is defined as qα[Z] := E[max{(1 − α)(H⁻¹(α) − Z), α(Z − H⁻¹(α))}], where H⁻¹(α) is the left-side α-quantile of the random variable Z. It is well-defined and finite for all Z ∈ L₁(Ω, F, P) and can be shown to be qα[Z] = min{E[max{(1 − α)(t − Z), α(Z − t)}]}.",
        "The risk functional qα[Z] can be used in mean-risk models, both in the case of minimization (using 1 − α) and maximization (using α), allowing for consideration of quantities for small α.",
        "Average Value-at-Risk (AV@R) is closely related to the mean-deviation from quantile model and is defined as AV@R[Z] := inf{t + α⁻¹E[Z − t]+}. The constraint AV@R[Zx] ≤ 0 is equivalent to the constraint inf{t + α⁻¹E[Z − t]+} ≤ 0 and gives a conservative approximation of the chance constraint V@R[Zx] ≤ 0.",
        "The function ρ(t) := t + α⁻¹E[Z − t]+ is convex, and its derivative at t is 1 + α⁻¹[Hz(t) − 1], provided that the cdf Hz(·) is continuous at t; the minimum of ρ(t) is attained on the interval [t*, t**], where t* and t** are the left- and right-side quantiles.",
        "The function ρ(Z) := AV@Rα(Z), defined on a space of random variables, is convex, and its derivative at t is equal to 1 + α⁻¹[Hz(t) − 1], provided that the cdf Hz(·) is continuous at t."
      ]
    },
    {
      "topic": "Coherent Risk Measures",
      "sub_topics": [
        "A risk measure is a function ρ(Z) mapping a space Z of random variables to the extended real line, and is proper if ρ(Z) > -∞ for all Z ∈ Z and its domain {Z ∈ Z : ρ(Z) < +∞} is nonempty. A risk measure ρ(Z) maps uncertain outcomes Z into the extended real line, where Z represents a space of allowable random functions, and the risk measure is considered proper if ρ(Z) > −∞ for all Z and the domain is nonempty. Risk measures are used to quantify risk, with a focus on spaces Z := Lp(Ω, F, P) where p ∈ [1, +∞).",
        "Coherent risk measures satisfy convexity (R1), monotonicity (R2), translation equivariance (R3), and positive homogeneity (R4), providing a consistent framework for risk assessment. Average Value-at-Risk is an example of a coherent risk measure. Axioms for risk measures include: Convexity (R1), ensuring diversification benefits; Monotonicity (R2), where if Z > Z', then p(Z) ≥ p(Z'); Translation equivariance (R3), where p(Z + a) = p(Z) + a; and Positive homogeneity (R4), where p(tZ) = tp(Z) for t > 0.",
        "The dual space Z* is associated with each space Z, and the scalar product is defined as (ζ, Z) := ∫Ω ζ(ω)Z(ω)dP(ω); the conjugate function ρ*(ζ) is defined as supZ∈Z{(ζ, Z) − ρ(Z)}, and the biconjugate function ρ**(Z) is defined as supζ∈Z∗{(ζ, Z) − ρ*(ζ)}.",
        "The Fenchel-Moreau theorem states that if ρ: Z → R is convex, proper, and lower semicontinuous, then ρ** = ρ, and the representation ρ(Z) = supζ∈Z∗{(ζ, Z) − ρ*(ζ)} holds.",
        "Risk measures satisfying conditions (R1)-(R3) are proper and lower semicontinuous, then the representation holds with A being a subset of the set of probability density functions, where  P := {ζ ∈ Z∗ : ∫Ω ζ(ω)dP(ω) = 1, ζ ≥ 0}.",
        "The conjugate function ρ*(ζ) of a risk measure ρ is defined as ρ*(ζ) := sup {⟨ζ, Z⟩ - ρ(Z)}, and the biconjugate function ρ**(Z) provides a representation if ρ is convex, proper, and lower semicontinuous.",
        "Theorems establish that if ρ satisfies certain conditions, its representation holds with A := dom(ρ*), and conditions (R2), (R3), and (R4) correspond to properties of the set A, such as nonnegativity, integral to one, and being the support function.",
        "If ρ satisfies conditions (R1)-(R3) and is proper and lower semicontinuous, then its representation holds with A being a subset of probability density functions, and if ρ is positively homogeneous, its conjugate is the indicator function of a convex set A C Z*.",
        "Differentiability properties of risk measures are explored, including the subdifferential ∂ρ(Z) and Hadamard directional differentiability, with connections to composite functions and the chain rule."
      ]
    },
    {
      "topic": "Risk Averse Optimization",
      "sub_topics": [
        "Stochastic optimization problems involve objective functions defined as the expected value, E[F(x, w)], where F models random outcomes dependent on decision variables x and random variable w. The goal is to minimize f(x) over a feasible set X.",
        "Risk-averse preferences in stochastic optimization are addressed using expected utility theory, where scalar transformations u(Z) of random outcomes Z are considered, and decisions are based on E[u(Z)]. In minimization problems, a risk-averse approach prefers a random outcome Z₁ over Z₂ if E[u(Z₁)] < E[u(Z₂)], where u is a nondecreasing and convex disutility function. Instead of minimizing E[F(x, w)], risk-averse optimization minimizes E[u(F(x, w))], where u is a disutility function, assumed to be nondecreasing and convex, ensuring that a certain outcome is preferred over a random one.",
        "Mean-risk models characterize uncertain outcomes Zx(w) using two scalar characteristics: the mean E[Z] and the risk measure D[Z], which quantifies the uncertainty of the outcome. Efficient solutions in mean-risk models are found by minimizing risk for a given mean value or maximizing the mean for a given risk value, formulated as a parametric optimization problem using scalarization techniques.",
        "For a coefficient c > 0, a composite objective functional ρ[Z] := E[Z] + cD[Z] is formed, where c represents the price of risk, and the optimization problem becomes Min E[Zx] + cD[Zx].",
        "Central semideviations are a class of risk functionals used in mean-risk models, with the upper semideviation of order p defined as σ+p[Z] := (E[(Z − E[Z])p]+)1/p, penalizing excesses over the mean in minimization problems, with the general form of the mean-risk model being Min E[Zx] + cσp[Zx].",
        "The Average Value-at-Risk (AV@R) is defined as AV@R(Z) := inf {t + α⁻¹E[Z - t]+}, representing the expected loss exceeding the Value-at-Risk (V@R) at level α, and is related to mean deviations from quantiles."
      ]
    },
    {
      "topic": "Optimization of Risk Measures",
      "sub_topics": [
        "Optimization of risk measures involves minimizing a composite function φ(·) := ρ(F(·)), where F: Rⁿ → Z and ρ: Z → R, leading to problems of the form Min {φ(x) := ρ(F(x))}.",
        "When ρ is the expectation operator, the problem becomes a risk-neutral stochastic problem; however, incorporating risk control motivates the use of various risk measures.",
        "Under certain conditions, the minimax theorem allows interchanging the min and max operators, leading to a dual problem where the goal is to maximize the infimum of the Lagrangian function.",
        "Duality results, based on convexity and lower semicontinuity, provide conditions under which there is no duality gap and optimal solutions exist for both the primal and dual problems.",
        "A key result is that if a risk measure satisfies certain conditions and is continuous, then a saddle point exists, and the Karush-Kuhn-Tucker (KKT) conditions provide necessary and sufficient conditions for optimality.",
        "The concept of nonanticipativity constraints is introduced, where decisions are based on available information, leading to a dualization framework and the formulation of a dual problem.",
        "Interchangeability principle for risk measures allows to obtain relaxation of the optimization problem by removing nonanticipativity constraints."
      ]
    }
  ]
}