{
  "topics": [
    {
      "topic": "Stochastic Programming Models",
      "sub_topics": [
        "Stochastic programming addresses optimization problems with uncertain parameters modeled as random variables, distinguishing it from deterministic optimization where parameters are known constants.  Unlike deterministic optimization, there isn't a single generic formulation due to the variety of ways uncertainty can manifest in applied problems. The presence of random quantities in the model under consideration opens the door to a wealth of different problem settings, reflecting different aspects of the applied problem at hand. The chapter illustrates the main approaches that can be followed when developing a suitable stochastic optimization model.",
        "Stochastic programming models address situations where decisions must be made before the actual values of uncertain parameters are known. These models incorporate recourse actions to mitigate the impact of unfavorable outcomes once the uncertainty is resolved. Two-stage stochastic programming involves making decisions in two stages: first-stage decisions (here-and-now decisions) are made before the realization of random variables, while second-stage (recourse/wait-and-see) decisions are made after the random variables are observed to adjust for any deviations. Relatively complete recourse refers to the property that the second-stage problem is feasible for every possible realization of the random data. Stochastic programming problems can be approached by exploring convexity of the underlying problem and attempting to solve problems with a state vector of high dimension, achieved by means of discretization of the random process in a form of a scenario tree.",
        "The 'news vendor problem' is a classic example illustrating stochastic programming, where a company must decide on the order quantity of a product to meet uncertain demand, balancing ordering costs with potential backorder or holding costs. This problem is modeled as a two-stage stochastic program with a recourse action.",
        "The expected value problem minimizes the expected total cost, considering the probability distribution of the random demand. This approach is justified by the Law of Large Numbers, where the average cost over many repetitions converges to the expected value, making the solution optimal on average. The cumulative distribution function (CDF) H(x) represents the probability that a random variable D is less than or equal to x, and it is a key component in solving expected value problems. Stochastic programs can be reformulated as deterministic optimization problems by writing the expected value as a weighted sum over a finite number of scenarios, leading to linear programming formulations with decomposable structures. The optimal solution of a stochastic programming problem can be defined by a quantile, which is a value below which a given proportion of observations in a group of observations fall.",
        "Chance constraints are used to control the risk associated with stochastic programming models. These constraints ensure that the probability of violating certain conditions (e.g., exceeding a cost threshold) remains below a specified significance level. The chance-constrained model ensures that the probability of satisfying demand is larger than some fixed service level, leading to a probabilistic constraint on the decision variables.",
        "Multistage stochastic programming models address sequential decision-making problems over multiple time periods, where decisions at each stage depend on the information available at that time, incorporating the nonanticipativity constraint. Dynamic programming equations are used to solve multistage stochastic programming problems by decomposing the problem into a series of smaller subproblems. These equations are solved backward in time, starting from the last stage and working backward to the first stage. Value functions in dynamic programming represent the optimal value of the remaining subproblem given the current state, and they are used to link the subproblems together. Stagewise independence simplifies multistage stochastic programming models by assuming that the random variables at each stage are independent of the past. This assumption allows for closed-form solutions and reduces the computational complexity of the problem. The basestock policy is an optimal policy for inventory control problems under stagewise independence, where the order quantity is determined by the difference between a basestock level and the current inventory level.",
        "The worst-case approach prepares for the worst possible outcome by minimizing the maximum cost over a specified uncertainty set, providing a robust solution against adverse realizations of the random variables. Uncertainty sets are used in robust optimization to represent the range of possible values for the uncertain parameters, and the solution is optimized for the worst-case scenario within this set."
      ]
    },
    {
      "topic": "Multiproduct Assembly",
      "sub_topics": [
        "Two-stage stochastic programming is applied to multiproduct assembly problems where the demand for the products is uncertain. The first-stage problem involves determining the optimal quantities of parts to order before knowing the demand for the products, while the second-stage problem determines the optimal production plan to satisfy the observed demand, given the available parts. A two-stage model considers a manufacturer producing n products with m different parts ordered from third-party suppliers. The demand for the products is modeled as a random vector D = (D\\u2081, ..., D\\u2099). The first-stage problem determines the quantities x\\u2c7c of parts to be ordered, while the second-stage problem determines how much of each product to make after the demand D is observed, subject to the constraint that the available numbers of parts are not exceeded. In the special case of finitely many demand scenarios, the two-stage problem can be written as one large-scale linear programming problem (1.25), where the numbers of variables and constraints are roughly proportional to the number of scenarios K.",
        "The second-stage problem in the multiproduct assembly model is a linear programming problem that determines the optimal production plan to minimize costs or maximize profits, subject to constraints on the available parts and the demand for the products.",
        "Chance constrained models can be used to address the risk of losing demand in multiproduct assembly problems. These models ensure that the probability of satisfying all demand is above a certain service level. The chance constrained model ensures that the probability that all demand be satisfied is larger than some fixed service level 1 - \\u03b1, where \\u03b1 \\u2208 (0, 1) is small.",
        "Multistage models extend the multiproduct assembly problem to multiple time periods, where the manufacturer must make ordering and production decisions at each stage, depending on the information available at that time. The goal is to minimize the expected total cost over the planning horizon. A multistage model considers a planning horizon of T periods, where the demand is modeled as a stochastic process D\\u209c. The problem is to specify which of the decision variables may depend on which part of the past information. Dynamic programming equations are used to solve the multistage problem, where the optimal value depends on the latest inventory levels, order quantities, and the present demand."
      ]
    },
    {
      "topic": "Portfolio Selection",
      "sub_topics": [
        "Stochastic programming is used in portfolio selection to optimize investment decisions under uncertainty. The goal is to maximize the expected return on investment while controlling the associated risk.",
        "Static portfolio selection models consider a single investment period and aim to determine the optimal allocation of capital among different assets, considering the uncertain return rates of those assets. A static model aims to invest capital W\\u2080 in n assets, maximizing the expected return on an investment, where returns R\\u1d62 are random variables. The optimization problem maximizes the expected return subject to the constraint that the sum of investments equals the initial capital, i.e., Max \\u2211\\u03bc\\u1d62x\\u1d62 s.t. \\u2211x\\u1d62 = W\\u2080.",
        "The expected utility approach maximizes the expected utility of the wealth, where the utility function reflects the investor's risk preferences. This approach requires specifying the utility function, which can be concave and nondecreasing. An alternative approach maximizes the expected utility of the wealth represented by a concave nondecreasing function U(W\\u2081).",
        "Risk control can be achieved by maximizing the expected return subject to a constraint on the variability of the investment, measured by its variance. This approach involves balancing the expected return with the level of risk. Another approach maximizes the expected return while controlling the involved risk of the investment, measured by the variance of W, i.e., Var[W] = E[W\\u00b2] - (E[W])\\u00b2.",
        "Chance constraints can be used to control risk by ensuring that the probability of the wealth not falling below a chosen amount is above a specified level. This approach involves setting a threshold on the acceptable level of risk, leading to a Value-at-Risk (VaR) constraint. Risk control can also be approached by imposing chance constraints, ensuring that with probability at least 1 - \\u03b1 our wealth W\\u2081 should not fall below a chosen amount b, i.e., Pr{\\u2211\\u03be\\u1d62x\\u1d62 \\u2265 b} \\u2265 1 - \\u03b1.",
        "Multistage portfolio selection models allow for rebalancing the portfolio over multiple time periods, adjusting the allocation of capital among different assets based on the observed returns in previous periods. A multistage portfolio selection problem allows rebalancing the portfolio in time periods t = 1, ..., T - 1, maximizing the expected utility of the wealth at the last period, i.e., Max E[U(W\\u209c)]. Dynamic programming equations are used to solve the multistage problem backward in time, where the optimization is performed over all implementable and feasible policies. Under the assumption of stagewise independence, the optimal policy is obtained in a myopic way as an optimal solution of the problem (1.60)."
      ]
    },
    {
      "topic": "Supply Chain Network Design",
      "sub_topics": [
        "Stochastic programming can be applied to supply chain network design problems to optimize the configuration of the supply chain under uncertain demand and supply conditions. The goal is to minimize the total cost of the supply chain while ensuring that customer demand is met. Stochastic programming is used to model supply chain network design, where decisions about building facilities and procuring machines must be made under uncertainty about operational parameters. A supply chain is a network of suppliers, manufacturing plants, warehouses, and distribution channels organized to acquire raw materials, convert these raw materials to finished products, and distribute these products to customers.",
        "The two-stage stochastic programming approach involves making decisions about the configuration of the supply chain (e.g., which facilities to build) in the first stage, and then making operational decisions (e.g., how much to produce and transport) in the second stage, after the uncertain demand and supply conditions are realized. A two-stage stochastic program is formulated, where the first-stage decisions involve the configuration of the supply chain, and the second-stage decisions involve the flow of products through the network. The supply chain configuration decisions consist of deciding which of the processing centers to build and which processing and finishing machines to procure. It is realistic to assume that at the time at which a decision about vector x \\u2208 X should be made, there is an uncertainty about parameters involved in operational decisions represented by vector y. The problem can be written in the following equivalent form as a two-stage program: Min c\\u1d40x + E[Q(x, \\u03be)], where Q(x, \\u03be) is the optimal value of the second-stage problem. A distinctive feature of the stochastic programming problem is that the first-stage problem here is a combinatorial problem with binary decision variables and finite feasible set X.",
        "The second-stage problem is typically a linear programming problem that determines the optimal production and transportation plan to minimize costs or maximize profits, subject to constraints on the available capacity and the demand for the products. The objective is to minimize the total investment and operational costs, subject to constraints on flow conservation, demand satisfaction, supply limits, capacity constraints, and logical dependencies.",
        "Recourse actions can be incorporated into the model to address situations where demand is not satisfied, such as supplying the deficit at a penalty cost. This allows for flexibility in the supply chain and reduces the risk of stockouts. The second-stage problem may be infeasible for some realizations of the random data, which can be resolved by introducing recourse actions, such as supplying the deficit at a penalty cost.",
        "A deterministic mathematical model for the supply chain design problem can be written as follows: Min c\\u1d40x + \\u2211\\u2211q\\u1d62\\u2c7cy\\u1d62\\u2c7c s.t. ..."
      ]
    },
    {
      "topic": "Inventory",
      "sub_topics": [
        "The news vendor problem is a two-stage stochastic program where a decision about the order quantity x is made before the demand D is known, and a recourse action (additional ordering) may be taken at a higher cost b > c after the demand d is realized.",
        "The expected value problem minimizes the expected total cost E[F(x, D)] viewed as a function of the order quantity x, where F(x, D) is the total cost function. By the Law of Large Numbers, this approach is optimal on average if the process repeats itself. The optimal solution of the expected value problem (1.4) is defined by the quantile x = H\\u207b\\u00b9(\\u03ba), where H(x) is the cumulative distribution function (cdf) of the demand D, and \\u03ba = (b - c) / (b + h).",
        "In the case of finitely many scenarios, the stochastic program can be modeled as a deterministic optimization problem by writing the expected value E[F(x, D)] as a weighted sum of the costs for each scenario.",
        "The worst-case approach minimizes the maximum cost over a range of possible demand values, i.e., Min\\u2093 max_{d\\u2208[l, u]} F(x, d), where [l, u] are known lower and upper bounds for the demand.",
        "Chance constraints are introduced to ensure that the probability of the cost F(x, D) being larger than a threshold \\u03c4 is less than a specified value \\u03b1 \\u2208 (0, 1), i.e., Pr{F(x, D) > \\u03c4} < \\u03b1.",
        "A multistage model involves a planning horizon of T periods, where the demand is modeled as a random process D\\u209c indexed by time t = 1, ..., T. The objective is to minimize the expected value of the total cost over the planning horizon, subject to the nonanticipativity constraint. Dynamic programming equations are used to solve the multistage model backward in time, where the decision about the inventory level x\\u209c depends only on information available at the time of the decision, i.e., on an observed realization d[t-1] of the demand process. Under the assumption of stagewise independence, an optimal policy x\\u209c = x\\u209c(y\\u209c) is a function of the inventory level y\\u209c alone, and it is possible to give a characterization of the optimal policy by minimizing (1.22)."
      ]
    }
  ]
}