{
  "topics": [
    {
      "topic": "Expected Recourse Cost",
      "sub_topics": [
        "When the random vector `\\u03be` has a finite support, meaning it can only take on a finite number of realizations (scenarios) `\\u03bek` with associated probabilities `pk`, the expected recourse cost can be expressed as a weighted sum: `E[Q(x, \\u03be)] = \\u03a3 pk Q(x, \\u03bek)`. In the case of discrete distributions, the two-stage stochastic programming problem can be reformulated as a large-scale deterministic linear programming problem, where each scenario `\\u03bek` corresponds to a separate set of second-stage variables `yk`, and the objective is to minimize the sum of the first-stage cost and the weighted average of the second-stage costs across all scenarios.",
        "The subdifferential of the expected recourse cost function, `\\u2202\\u03c6(x)`, at a given point `x` is the negative of the set of optimal solutions to the dual of the second-stage problem, transformed by the transpose of the matrix `T` and averaged over all scenarios, providing essential information for optimization algorithms.",
        "When the distribution of the random vector `\\u03be` is continuous, ensuring that the expectation `E[Q(x, \\u03be)]` is well-defined requires verifying that the function `Q(x, \\u03be)` is measurable and that either `E[Q(x, \\u03be)+]` or `E[(-Q(x, \\u03be))+]` is finite, where `Q(x, \\u03be)+` and `(-Q(x, \\u03be))+` represent the positive parts of `Q(x, \\u03be)` and `-Q(x, \\u03be)`, respectively.",
        "For general distributions of the random vector \\u03be, key assumptions such as fixed recourse (W is fixed) and complete recourse (Wy = x has a solution for every x) are introduced; fixed recourse simplifies the analysis, while complete recourse ensures that the feasible set of the dual problem is bounded; relatively complete recourse requires the second-stage problem to be feasible for almost every realization of \\u03be. Sufficient conditions are provided for relatively complete recourse, such as Q(x, \\u03be) < +\\u221e for all \\u03be in the support of the distribution; however, this condition is not always necessary, especially when the random vector has a finite support or the recourse is fixed; Hoffman's lemma is invoked to establish conditions for the existence of the expectation E[sq(h \\u2212 Tx)], where sq(\\u00b7) is the support function of the set \\u03a0(q)."
      ]
    },
    {
      "topic": "Polyhedral and General Two-Stage Problems",
      "sub_topics": [
        "Two-stage stochastic programming problems are generalized to the case where the functions f\\u2081(\\u00b7) and f\\u2082(\\u00b7, \\u03c9) are polyhedral, allowing for a more flexible representation of costs and constraints; the first-stage cost function f\\u2081(\\u00b7) is polyhedral, meaning it can be represented as the maximum of a finite number of affine functions, while the second-stage cost function f\\u2082(\\u00b7, \\u03c9) is random polyhedral, with random vectors and scalars defining its structure. The linear two-stage model is shown to be a special case of the polyhedral two-stage problem, and any polyhedral two-stage model can be reformulated as a linear two-stage model; this reformulation involves introducing auxiliary variables and constraints, but it allows for the application of linear programming techniques to solve polyhedral problems; the Lagrangian of the second-stage problem is considered, and the dual problem is derived.",
        "The set of optimal solutions of the dual problem D(x, \\u03c9) plays a crucial role in characterizing the properties of the recourse function; the expected value function \\u03c6(x) is defined, and conditions for its well-definedness are explored, particularly in the case of fixed recourse; the concept of fixed recourse is extended to the polyhedral case, where the matrix W and the set Y are fixed and do not depend on \\u03c9. Under fixed recourse and certain conditions, the expectation function \\u03c6(x) is well-defined and Lipschitz continuous on its domain; the domain of \\u03c6(x) is characterized as the set of x for which h \\u2212 Tx \\u2208 W(Y) with probability 1; optimality conditions are formulated for polyhedral two-stage problems with finitely many elementary events, involving the existence of \\u03c0k \\u2208 D(x, \\u03c9k) satisfying specific conditions.",
        "For general distributions, optimality conditions require additional assumptions such as the nonemptiness of the set \\u03a0(\\u03c9) with probability 1 and a condition on the moments of the random variables; the optimality condition involves the existence of a measurable function \\u03c0(\\u03c9) \\u2208 D(x, \\u03c9) satisfying a specific equation; the analysis becomes more complicated when the recourse is not relatively complete. The concept of nonanticipativity is discussed in the context of polyhedral two-stage problems, and the dualization of nonanticipativity constraints is explored; the Lagrangian is written, and the dual function is derived; the nonanticipativity duality is extended to general distributions, and the dual problem is formulated; the value of perfect information is introduced as a measure of the benefit of knowing the realization of the random data before making the first-stage decision.",
        "Two-stage stochastic programming problems are presented in a general form, involving a first-stage problem with a cost function that depends on the expected value of a second-stage problem; the second-stage problem is formulated as minimizing a function g(x, y, \\u03c9) over a set g(x, \\u03c9), where x is the first-stage decision, y is the second-stage decision, and \\u03c9 is a random event; the concept of random lower semicontinuity is introduced to ensure the measurability of the optimal value function. The interchangeability principle is invoked to establish the equivalence between the two-stage problem and a problem that minimizes the expected value of g(x, y(\\u03c9), \\u03c9) subject to the constraint that y(\\u03c9) belongs to g(x, \\u03c9) almost everywhere; this equivalence is crucial for solving two-stage problems by optimizing over measurable mappings y(\\u03c9); the case of a finite number of scenarios is considered, leading to a formulation involving the minimization of a sum of costs over all scenarios.",
        "The concept of convex two-stage problems is introduced, where the set X is convex and the function g(x, y, \\u03c9) is convex in (x, y) for every \\u03c9; conditions for the convexity of the multifunction g(x, \\u03c9) are explored; the multifunction g(x, \\u03c9) is defined in a specific form involving functions T and W, a set Y, and a cone C, and the convexity of T and W with respect to C is discussed. The second-stage problem is written in a specific form involving functions q\\u03c9(y) and W(y), and the Lagrangian dual of this problem is considered; results from convex analysis are invoked to establish properties of the optimal value functions, such as convexity and subdifferentiability; the differentiability properties of the optimal value functions are also characterized in terms of the dual problem.",
        "The expectation function f(x) is analyzed, and conditions for its subdifferentiability are provided; optimality conditions are formulated for the general two-stage problem, involving the existence of a measurable selection \\u03c0(\\u03c9) satisfying a specific equation; the concept of nonanticipativity is introduced, and the dualization of nonanticipativity constraints is discussed. The value of perfect information is introduced as a measure of the benefit of knowing the realization of the random data before making the first-stage decision; the wait-and-see solution is defined as the optimal solution of the second-stage problem when the data is known; the expected value of perfect information (EVPI) is defined and its properties are explored."
      ]
    }
  ]
}